#+TITLE: LabBook
#+AUTHOR: Anderson Mattheus Maliszewski
#+STARTUP: overview indent
#+TAGS: noexport(n) deprecated(d) 
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)

This LabBook is for the *CMP223 - Computer System Performance* *Analysis
(2019/2)* final work and has a wealth of informations about the entire
process used during the proposed experiments. To reproduce this
evaluation, you can follow the steps below. Have fun!

#+BEGIN_QUOTE
*Reporting errors*: This repository has several links to self-contained
 files as well as links from the Internet, so if you try to reproduce
 it and find broken links or other problems, please tell me everything
 so that I can improve it. :)
#+END_QUOTE

**** Read CSVs
#+begin_src R :results output :session *R* :exports both
options(crayon.enabled=FALSE)
suppressMessages(library("tidyverse"));
df_intel <- read_csv("LOGS/intel.22-11-2019.16h44m04s.csv", progress=FALSE)
df_apps <- read_csv("LOGS/apps_exec.22-11-2019.16h44m04s.csv", progress=FALSE)
    
df_apps %>%
      group_by(apps,interface) %>%
      summarise(
        average=mean(time),
        std=sd(time),
        ste=3*std/sqrt(n()),
        N=n()) %>%
      arrange(apps,interface) -> df_apps
df_apps

df_intel %>%
  filter(bytes != 0) %>%
  group_by(interface,bytes) %>%
  summarise(
    average=mean(time),
    std=sd(time),
    ste=3*std/sqrt(n()),
    N=n()) %>%
  arrange(interface,bytes) -> df_intel_latency
df_intel_latency

df_intel %>%
  filter(bytes != 0) %>%
  group_by(interface,bytes) %>%
  summarise(
    average=mean(`mbytes-sec`),
    std=sd(`mbytes-sec`),
    ste=3*std/sqrt(n()),
    N=n()) %>%
  arrange(interface,bytes) -> df_intel_band
df_intel_band

#+end_src

#+RESULTS:
#+begin_example

Parsed with column specification:
cols(
  apps = col_character(),
  interface = col_character(),
  bytes = col_double(),
  time = col_double(),
  `mbytes-sec` = col_double()
)

Parsed with column specification:
cols(
  apps = col_character(),
  interface = col_character(),
  time = col_double()
)

# A tibble: 33 x 6
# Groups:   apps [11]
   apps      interface average   std   ste     N
   <
    <
      <
<
<
<int>
 1 exec_alya eth         297.  1.77  0.968    30
 2 exec_alya ib          254.  2.79  1.53     30
 3 exec_alya ipoib       281.  2.90  1.59     30
 4 exec_bt   eth         505.  1.54  0.842    30
 5 exec_bt   ib          380.  4.17  2.28     30
 6 exec_bt   ipoib       544.  3.51  1.92     30
 7 exec_cg   eth         761.  8.24  4.51     30
 8 exec_cg   ib          183.  1.01  0.551    30
 9 exec_cg   ipoib       181.  2.58  1.41     30
10 exec_ep   eth          37.4 0.422 0.231    30
# … with 23 more rows

# A tibble: 69 x 6
# Groups:   interface [3]
   interface bytes average   std   ste     N
   <
    <
  <
<
<
<int>
 1 eth           1    6.42 0.456 0.250    30
 2 eth           2    6.28 0.470 0.257    30
 3 eth           4    6.18 0.472 0.258    30
 4 eth           8    6.07 0.381 0.209    30
 5 eth          16    6.02 0.338 0.185    30
 6 eth          32    5.98 0.301 0.165    30
 7 eth          64    5.98 0.280 0.153    30
 8 eth         128    5.99 0.272 0.149    30
 9 eth         256    5.99 0.247 0.136    30
10 eth         512    6.02 0.218 0.119    30
# … with 59 more rows

# A tibble: 69 x 6
# Groups:   interface [3]
   interface bytes average    std     ste     N
   <
    <
  <
 <
  <
<int>
 1 eth           1   0.157 0.0106 0.00578    30
 2 eth           2   0.320 0.0230 0.0126     30
 3 eth           4   0.651 0.0487 0.0267     30
 4 eth           8   1.32  0.0821 0.0450     30
 5 eth          16   2.67  0.147  0.0803     30
 6 eth          32   5.36  0.264  0.145      30
 7 eth          64  10.7   0.488  0.267      30
 8 eth         128  21.4   0.945  0.518      30
 9 eth         256  42.8   1.72   0.940      30
10 eth         512  85.2   2.98   1.63       30
# … with 59 more rows
#+end_example
***** Read CSVs
#+begin_src R :results output :session *R* :exports both
options(crayon.enabled=FALSE)
suppressMessages(library(tidyverse))
df.ft <- read_csv("LOGS/TRACE/charac_ft.eth/charac_ft.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "FT") %>%
  select(Rank, everything())
df.ft

df.ep <- read_csv("LOGS/TRACE/charac_ep.eth/charac_ep.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "EP") %>%
  select(Rank, everything())
df.ep

df.is <- read_csv("LOGS/TRACE/charac_is.eth/charac_is.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "IS") %>%
  select(Rank, everything())
df.is

df.sp <- read_csv("LOGS/TRACE/charac_sp.eth/charac_sp.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "SP") %>%
  select(Rank, everything())
df.sp
#+end_src

#+RESULTS:
#+begin_example

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 8,193 x 6
    Rank Start   End Duration Value          App  
   <
<
<
   <
<
         <chr>
 1    99 0.779  1.52 0.745    MPI_Init       FT   
 2    99 1.52   1.52 0.000001 MPI_Comm_size  FT   
 3    99 1.52   1.52 0        MPI_Comm_rank  FT   
 4    99 1.52   1.53 0.00158  MPI_Bcast      FT   
 5    99 1.53   1.53 0.000094 MPI_Bcast      FT   
 6    99 1.53   1.53 0.000101 MPI_Bcast      FT   
 7    99 1.53   1.53 0.000054 MPI_Bcast      FT   
 8    99 1.53   1.53 0.000001 MPI_Bcast      FT   
 9    99 1.53   1.53 0.00254  MPI_Comm_split FT   
10    99 1.53   1.53 0.00188  MPI_Comm_split FT   
# … with 8,183 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 1,280 x 6
    Rank  Start   End Duration Value         App  
   <
 <
<
   <
<
        <chr>
 1    99  0.800  1.72 0.920    MPI_Init      EP   
 2    99  1.72   1.72 0.000001 MPI_Comm_rank EP   
 3    99  1.72   1.72 0        MPI_Comm_size EP   
 4    99  1.72   1.72 0.00199  MPI_Bcast     EP   
 5    99  1.72   1.72 0.000323 MPI_Barrier   EP   
 6    99 38.3   38.9  0.595    MPI_Allreduce EP   
 7    99 38.9   38.9  0.000558 MPI_Allreduce EP   
 8    99 38.9   38.9  0.000432 MPI_Allreduce EP   
 9    99 38.9   38.9  0.000344 MPI_Allreduce EP   
10    99 38.9   38.9  0.000841 MPI_Finalize  EP   
# … with 1,270 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 5,501 x 6
    Rank  Start   End  Duration Value         App  
   <
 <
<
    <
<
        <chr>
 1    99  0.740  1.56  0.816    MPI_Init      IS   
 2    99  1.56   1.56  0.000005 MPI_Comm_rank IS   
 3    99  1.56   1.56  0.000002 MPI_Comm_size IS   
 4    99  1.56   1.56  0.00164  MPI_Bcast     IS   
 5    99  3.99   5.24  1.25     MPI_Allreduce IS   
 6    99  5.24   5.25  0.00662  MPI_Alltoall  IS   
 7    99  5.25  22.9  17.6      MPI_Alltoallv IS   
 8    99 23.6   23.6   0.0828   MPI_Allreduce IS   
 9    99 23.6   23.6   0.00164  MPI_Alltoall  IS   
10    99 23.6   38.1  14.5      MPI_Alltoallv IS   
# … with 5,491 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 15,226,704 x 6
    Rank Start   End Duration Value          App  
   <
<
<
   <
<
         <chr>
 1   143 0.386  1.24 0.853    MPI_Init       SP   
 2   143 1.24   1.24 0.000004 MPI_Comm_size  SP   
 3   143 1.24   1.24 0        MPI_Comm_rank  SP   
 4   143 1.24   1.24 0.00253  MPI_Comm_split SP   
 5   143 1.24   1.24 0.000001 MPI_Comm_size  SP   
 6   143 1.24   1.24 0.00192  MPI_Comm_dup   SP   
 7   143 1.24   1.25 0.00187  MPI_Comm_dup   SP   
 8   143 1.25   1.25 0.00134  MPI_Bcast      SP   
 9   143 1.25   1.25 0.000147 MPI_Bcast      SP   
10   143 1.25   1.25 0.000093 MPI_Bcast      SP   
# … with 15,226,694 more rows
#+end_example

***** Read CSVs
#+begin_src R :results output :session *R* :exports both
options(crayon.enabled=FALSE)
suppressMessages(library(tidyverse))
df.mg <- read_csv("LOGS/TRACE/charac_mg.eth/charac_mg.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "MG") %>%
  select(Rank, everything())
df.mg

df.cg <- read_csv("LOGS/TRACE/charac_cg.eth/charac_cg.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "CG") %>%
  select(Rank, everything())
df.cg

df.lu <- read_csv("LOGS/TRACE/charac_lu.eth/charac_lu.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "LU") %>%
  select(Rank, everything())
df.lu

df.bt <- read_csv("LOGS/TRACE/charac_bt.eth/charac_bt.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "BT") %>%
  select(Rank, everything())
df.bt
#+end_src

#+RESULTS:
#+begin_example

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 3,102,496 x 6
    Rank Start   End Duration Value          App  
   <
<
<
   <
<
         <chr>
 1    99 0.866  1.61 0.741    MPI_Init       MG   
 2    99 1.61   1.61 0.000001 MPI_Comm_rank  MG   
 3    99 1.61   1.61 0        MPI_Comm_size  MG   
 4    99 1.61   1.61 0.00225  MPI_Comm_split MG   
 5    99 1.61   1.61 0.000244 MPI_Barrier    MG   
 6    99 1.61   1.61 0.00224  MPI_Bcast      MG   
 7    99 1.61   1.61 0.000049 MPI_Bcast      MG   
 8    99 1.61   1.61 0.000092 MPI_Bcast      MG   
 9    99 1.61   1.61 0.000150 MPI_Bcast      MG   
10    99 1.61   1.61 0.000042 MPI_Bcast      MG   
# … with 3,102,486 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 13,265,024 x 6
    Rank Start   End Duration Value         App  
   <
<
<
   <
<
        <chr>
 1    99 0.127 0.895 0.768    MPI_Init      CG   
 2    99 0.895 0.895 0.000001 MPI_Comm_rank CG   
 3    99 0.895 0.895 0        MPI_Comm_size CG   
 4    99 0.895 0.898 0.00324  MPI_Bcast     CG   
 5    99 8.18  8.18  0.000291 MPI_Irecv     CG   
 6    99 8.18  8.18  0.000118 MPI_Send      CG   
 7    99 8.18  8.20  0.0209   MPI_Wait      CG   
 8    99 8.20  8.20  0.00001  MPI_Irecv     CG   
 9    99 8.20  8.20  0.000029 MPI_Send      CG   
10    99 8.20  8.20  0.000002 MPI_Wait      CG   
# … with 13,265,014 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 113,834,493 x 6
    Rank Start   End Duration Value         App  
   <
<
<
   <
<
        <chr>
 1    99 0.743  1.57 0.830    MPI_Init      LU   
 2    99 1.57   1.57 0.000001 MPI_Comm_rank LU   
 3    99 1.57   1.57 0        MPI_Comm_size LU   
 4    99 1.57   1.57 0.00151  MPI_Bcast     LU   
 5    99 1.57   1.57 0.000103 MPI_Bcast     LU   
 6    99 1.57   1.57 0.000085 MPI_Bcast     LU   
 7    99 1.57   1.57 0.000051 MPI_Bcast     LU   
 8    99 1.57   1.57 0.000098 MPI_Bcast     LU   
 9    99 1.57   1.57 0.000013 MPI_Bcast     LU   
10    99 1.57   1.57 0.000086 MPI_Bcast     LU   
# … with 113,834,483 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 10,016,496 x 6
    Rank Start   End Duration Value          App  
   <
<
<
   <
<
         <chr>
 1   143 0.893  1.72 0.822    MPI_Init       BT   
 2   143 1.72   1.72 0.000001 MPI_Comm_size  BT   
 3   143 1.72   1.72 0        MPI_Comm_rank  BT   
 4   143 1.72   1.72 0.00260  MPI_Comm_split BT   
 5   143 1.72   1.72 0        MPI_Comm_size  BT   
 6   143 1.72   1.72 0.00188  MPI_Comm_dup   BT   
 7   143 1.72   1.72 0.00180  MPI_Comm_dup   BT   
 8   143 1.72   1.72 0.00143  MPI_Bcast      BT   
 9   143 1.72   1.72 0.000151 MPI_Bcast      BT   
10   143 1.72   1.72 0.000002 MPI_Bcast      BT   
# … with 10,016,486 more rows
#+end_example

***** Read CSVs
#+begin_src R :results output :session *R* :exports both
options(crayon.enabled=FALSE)
suppressMessages(library(tidyverse))
df.imb.CPU <- read_csv("LOGS/TRACE/charac_imb_CPU.eth/charac_imb_CPU.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "ImbBench-CPU\n8Level") %>%
  select(Rank, everything())
df.imb.CPU

df.imb.mem <- read_csv("LOGS/TRACE/charac_imb_memory.eth/charac_imb_memory.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "ImbBench-Memory\n8Level") %>%
  select(Rank, everything())
df.imb.mem

df.alya <- read_csv("LOGS/TRACE/charac_alya.eth/charac_alya.eth.csv", col_names = FALSE, progress=FALSE) %>%
  mutate(Rank = gsub("MPI Rank", "", X2)) %>%
  select(-X1, -X2, -X3, -X7) %>%
  rename(Start = X4,
         End = X5,
         Duration = X6,
         Value = X8) %>%
  mutate(Rank = as.integer(Rank)) %>%
  mutate(App = "Alya") %>%
  select(Rank, everything())
df.alya
#+end_src

#+RESULTS:
#+begin_example

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 640 x 6
    Rank Start   End Duration Value         App                   
   <
<
<
   <
<
        <
                
 1   159  1.04  1.96 0.924    MPI_Init      "ImbBench-CPU\n8Level"
 2   159  1.96  1.96 0.000001 MPI_Comm_size "ImbBench-CPU\n8Level"
 3   159  1.96  1.96 0.000001 MPI_Comm_rank "ImbBench-CPU\n8Level"
 4   159 11.9  12.6  0.691    MPI_Finalize  "ImbBench-CPU\n8Level"
 5   158  1.04  1.96 0.923    MPI_Init      "ImbBench-CPU\n8Level"
 6   158  1.96  1.96 0.000001 MPI_Comm_size "ImbBench-CPU\n8Level"
 7   158  1.96  1.96 0        MPI_Comm_rank "ImbBench-CPU\n8Level"
 8   158 11.1  12.6  1.46     MPI_Finalize  "ImbBench-CPU\n8Level"
 9   157  1.06  1.96 0.908    MPI_Init      "ImbBench-CPU\n8Level"
10   157  1.96  1.96 0.000001 MPI_Comm_size "ImbBench-CPU\n8Level"
# … with 630 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 640 x 6
    Rank  Start   End  Duration Value         App                      
   <
 <
<
    <
<
        <
                   
 1   159  0.915  1.80  0.888    MPI_Init      "ImbBench-Memory\n8Level"
 2   159  1.80   1.80  0.000001 MPI_Comm_size "ImbBench-Memory\n8Level"
 3   159  1.80   1.80  0        MPI_Comm_rank "ImbBench-Memory\n8Level"
 4   159 87.1   94.2   7.10     MPI_Finalize  "ImbBench-Memory\n8Level"
 5   158  0.910  1.80  0.893    MPI_Init      "ImbBench-Memory\n8Level"
 6   158  1.80   1.80  0.000001 MPI_Comm_size "ImbBench-Memory\n8Level"
 7   158  1.80   1.80  0        MPI_Comm_rank "ImbBench-Memory\n8Level"
 8   158 72.6   94.2  21.6      MPI_Finalize  "ImbBench-Memory\n8Level"
 9   157  0.913  1.80  0.889    MPI_Init      "ImbBench-Memory\n8Level"
10   157  1.80   1.80  0.000001 MPI_Comm_size "ImbBench-Memory\n8Level"
# … with 630 more rows

Parsed with column specification:
cols(
  X1 = col_character(),
  X2 = col_character(),
  X3 = col_character(),
  X4 = col_double(),
  X5 = col_double(),
  X6 = col_double(),
  X7 = col_double(),
  X8 = col_character()
)

# A tibble: 24,550,772 x 6
    Rank Start   End Duration Value         App  
   <
<
<
   <
<
        <chr>
 1   159  1.61  2.52 0.913    MPI_Init      Alya 
 2   159  2.52  2.52 0.000001 MPI_Comm_size Alya 
 3   159  2.52  2.52 0        MPI_Comm_rank Alya 
 4   159  2.52  2.52 0.000029 MPI_Gather    Alya 
 5   159  2.52  2.52 0.000933 MPI_Bcast     Alya 
 6   159  2.52  2.52 0.000216 MPI_Scatter   Alya 
 7   159  2.52  2.52 0        MPI_Comm_size Alya 
 8   159  2.52  2.52 0        MPI_Comm_rank Alya 
 9   159  2.52  2.52 0.00002  MPI_Gather    Alya 
10   159  2.52  2.52 0.00073  MPI_Bcast     Alya 
# … with 24,550,762 more rows
#+end_example

